/************************************************************************************
*
* 文件名  : FilePath.h
*
* 文件描述: 文件路径操作类
*
* 创建人  : dingjing, 2009-01-12
*
* 版本号  : 1.0
*
* 修改记录:
*
************************************************************************************/
#ifndef _FILEPATH_H_
#define _FILEPATH_H_
#include <string>
using namespace std;
/////////////////////////////////////////////////////////////////////////////////////
class CFilePath
{
public:
	CFilePath();
	virtual ~CFilePath();

	/********************************************************************************
	* 函数名: GetExeFilePath
	* 功  能: 获得可执行文件的路径
	* 返回值: 可执行文件的路径
	********************************************************************************/
	static string GetExeFilePath();

	/********************************************************************************
	* 函数名: IsPathExist
	* 功  能: 判断路径是否存在
	* 返回值: 存在返回TRUE, 否则FALSE
	********************************************************************************/
	static bool IsPathExist(const char* lpPath);

	/********************************************************************************
	* 函数名: IsFileExist
	* 功  能: 判断文件是否存在
	* 返回值: 存在返回TRUE, 否则FALSE
	********************************************************************************/
	static bool IsFileExist(const char* lpFileName);

	/********************************************************************************
	* 函数名: GetPathLastFolderName
	* 功  能: 获得目录的最后一个文件夹名称
	* 返回值: 返回文件夹名称
	********************************************************************************/
	static string GetPathLastFolderName(const char* lpPath);

	/********************************************************************************
	* 函数名: GetExeName
	* 功  能: 删除文件夹下所有文件
	********************************************************************************/
	static string GetExeName(const char* lpPath);

	/********************************************************************************
	* 函数名: GetFileName
	* 功  能: 从路径中获得文件名称
	* 返回值: 返回文件名称
	********************************************************************************/
	static string GetFileName(const char* lpPath);

protected:

private:

};

/////////////////////////////////////////////////////////////////////////////////////
#endif