/************************************************************************************
*
* 文件名  : FilePath.h
*
* 文件描述: 文件路径操作类
*
* 创建人  : dingjing, 2009-01-12
*
* 版本号  : 1.0
*
* 修改记录:
*
************************************************************************************/
#ifndef _FILEPATH_H_
#define _FILEPATH_H_
#include <string>
using namespace std;
/////////////////////////////////////////////////////////////////////////////////////
class CFilePath
{
public:
	CFilePath();
	virtual ~CFilePath();

	/********************************************************************************
	* 函数名: GetExeFilePath
	* 功  能: 获得可执行文件的路径
	* 返回值: 可执行文件的路径
	********************************************************************************/
	static string GetExeFilePath();

	/********************************************************************************
	* 函数名: IsPathExist
	* 功  能: 判断路径是否存在
	* 返回值: 存在返回TRUE, 否则FALSE
	********************************************************************************/
	static BOOL IsPathExist(LPCTSTR lpPath);

	/********************************************************************************
	* 函数名: IsFileExist
	* 功  能: 判断文件是否存在
	* 返回值: 存在返回TRUE, 否则FALSE
	********************************************************************************/
	static BOOL IsFileExist(LPCTSTR lpFileName);

	/********************************************************************************
	* 函数名: GetPathLastFolderName
	* 功  能: 获得目录的最后一个文件夹名称
	* 返回值: 返回文件夹名称
	********************************************************************************/
	static string GetPathLastFolderName(LPCTSTR lpPath);

	/********************************************************************************
	* 函数名: IsFolderHasFile
	* 功  能: 文件夹下是否有文件存在
	* 返回值: 存在返回TRUE, 否则FALSE
	********************************************************************************/
	static BOOL IsFolderHasFile(LPCTSTR lpPath);

	/********************************************************************************
	* 函数名: DeleteFolderAllFile
	* 功  能: 删除文件夹下所有文件
	********************************************************************************/
	static void DeleteFolderAllFile(LPCTSTR lpPath);

	/********************************************************************************
	* 函数名: CopyFolderAllFile
	* 功  能: 复制文件夹strSrc下所有文件和文件夹到文件夹strDes
	* 返回值: 成功返回TRUE, 否则FALSE
	********************************************************************************/
	static BOOL CopyFolderAllFile(LPCTSTR strDes, LPCTSTR strSrc);

	/********************************************************************************
	* 函数名: GetExeName
	* 功  能: 删除文件夹下所有文件
	********************************************************************************/
	static string GetExeName(LPCTSTR lpPath);

protected:

private:

};

/////////////////////////////////////////////////////////////////////////////////////
#endif